Revit 2027 API
AnalysisDisplayStyle.SetDeformedShapeSettings Method
 Set deformed shape settings object for the style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings deformedShapeSettings
)
Public Sub SetDeformedShapeSettings (
	deformedShapeSettings As AnalysisDisplayDeformedShapeSettings
)
public:
void SetDeformedShapeSettings(
	AnalysisDisplayDeformedShapeSettings^ deformedShapeSettings
)
member SetDeformedShapeSettings :
        deformedShapeSettings : AnalysisDisplayDeformedShapeSettings -> unit
Parameters
deformedShapeSettings AnalysisDisplayDeformedShapeSettings
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Deformed shape settings were not created with the object.
See Also
Reference
AnalysisDisplayStyle Class
Autodesk.Revit.DB.Analysis Namespace